book_introduction/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 11]]
---
  def show
    @book = Book.find(params[:id])
    @comment = Book.find(params[:id]).comments.build

INSERT INTO "books" ("title", "price", "description", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "rails"], ["price", 2500], ["description", "railsに関する本です。"], ["rating", 100], ["created_at", "2017-06-13 01:47:18.468061"], ["updated_at", "2017-06-13 01:47:18.468061"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "railsに関する本です。\r\n非常に難しいです！"], ["updated_at", "2017-06-13 11:28:57.259016"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)