book_introduction/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("commenter", "body", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "test1"], ["body", "test1"], ["book_id", 10], ["created_at", "2017-06-15 04:57:13.866153"], ["updated_at", "2017-06-15 04:57:13.866153"]]

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? AND "comments"."id" = ? LIMIT ?  [["book_id", 10], ["id", 19], ["LIMIT", 1]]