book_introduction/app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
	def create
		params.permit!
		@book = Book.find(params[:book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
	    def destroy
	    	@book = Book.find(params[:book_id])