book_introduction/app/views/books/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."book_id" = ? LIMIT ?  [["book_id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 11]]
---
 <ul>
 <% if @book.comments.any? %>